clc;clear all;close all;
figure;
X = [36.8000000000000;67.8800000000000;48.9000000000000;60.5000000000000;36.8000000000000;55.8000000000000;58.6000000000000;31.7000000000000;13.4000000000000;9;8.20000000000000;19.9000000000000;14.6000000000000;24;19.3000000000000;16.2000000000000;6;9.60000000000000;15.9000000000000;27;30.2000000000000];%%乙醇转化率(%)
Y =[47.2100000000000;39.1000000000000;36.8500000000000;27.2500000000000;18.7500000000000;10.6500000000000;18.6400000000000;25.8900000000000;31.0400000000000;3.30000000000000;4.35000000000000;22.2600000000000;23.4600000000000;10.8300000000000;25.9700000000000;22.8800000000000;13.8100000000000;13.1000000000000;15.3400000000000;22.4100000000000;25.0500000000000];%%C4烯烃选择性(%)
for A_ii = 1:1:14
    plot(X(A_ii),Y(A_ii),'b.','markersize',35);
    xlabel('乙醇转化率(%)');
    ylabel('C4烯烃选择性(%)');
    hold on
end
for A_ii = 15:1:21
    plot(X(A_ii),Y(A_ii),'m.','markersize',35);
    xlabel('乙醇转化率(%)');
    ylabel('C4烯烃选择性(%)');
    hold on
end
hold on
%% 预测插值
X1 = 29.9;
Y1 = 39.04;
plot(X1,Y1,'r.','markersize',40);
%% 计算欧式距离
for length_ii = 1:1:length(X)
    Distance(length_ii) = sqrt((X(length_ii) -X1).^2+(Y(length_ii) -Y1).^2);
end
[min_Value,min_Location] = sort(Distance);
    hold on
line([X(min_Location(1)),X1],[Y(min_Location(1)),Y1],'linewidth',3);
    hold on
line([X(min_Location(4)),X1],[Y(min_Location(4)),Y1],'linewidth',3);
% for plot_ii = 1:1:2
%     hold on
% line([X(min_Location(plot_ii)),X1],[Y(min_Location(plot_ii)),Y1],'linewidth',3);
% end
